septober_v8/app/views/todos/_form.html.erb

SELECT "projects".* FROM "projects"
---
    <%= f.label :project_id %>
    <%= f.collection_select :project_id, Project.all, :id, :name, { prompt: "Select Project" }, { class: "form-control" } %>