septober_v8/app/controllers/todos_controller.rb

  def show
    @todo = Todo.find_by(id: params[:id], user_id: current_user.id)
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = 8 AND "todos"."user_id" = 2 LIMIT 1

  def edit
    @todo = Todo.find_by(id: params[:id], user_id: current_user.id)
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = 16 AND "todos"."user_id" = 3 LIMIT 1

  def _update_active(participle, new_active = nil)
    @todo = Todo.find_by(id: params[:id], user_id: current_user.id)
    new_active = !@todo.active if new_active.nil?

    if @todo.update(active: new_active)
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = 10 AND "todos"."user_id" = 2 LIMIT 1
UPDATE "todos" SET "active" = 1, "updated_at" = '2025-11-27 11:04:35.365180' WHERE "todos"."id" = 10