septober_v8/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_hash", "password_salt", "facebook_id", "admin", "description", "created_at", "updated_at") VALUES ('riccardo', 'palladiusbonton@gmail.com', '$2a$12$kxEeii0S6.qqbHZjhajEHeGT6cvYEWg9tzhGSbRxcl5Xlbnn7QvQq', '$2a$12$kxEeii0S6.qqbHZjhajEHe', NULL, NULL, NULL, '2025-11-27 10:45:46.175023', '2025-11-27 10:45:46.175023') RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save