septober_v8/app/views/projects/show.html.erb

SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = 4
---
  <ul>
    <% @project.todos.each do |todo| %>