app/controllers/projects_controller.rb

  def index
    @projects = Project.find_all_by_user_id(current_user.id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 2