septober_v8/app/models/todo.rb

  def self.provision_for_user(user)
    ver = '1.0.3'
    personal = Project.find_by(name: 'personal', user_id: user.id)
    work     = Project.find_by(name: 'work',     user_id: user.id)
    septober = Project.find_by(name: 'septober', user_id: user.id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."name" = 'work' AND "projects"."user_id" = 1 LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."name" = 'septober' AND "projects"."user_id" = 1 LIMIT 1